Revit 2027 API
BuiltInFailures.SubRegionFailures.SubDivisionPhaseMismatch Property
 Sub-division must have the same Phase Created parameter and Phase Demolished parameter as the host Toposolid. Sub-division phase will be set to match the Toposolid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SubDivisionPhaseMismatch { get; }
Public Shared ReadOnly Property SubDivisionPhaseMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SubDivisionPhaseMismatch {
	FailureDefinitionId^ get ();
}
static member SubDivisionPhaseMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SubRegionFailures Class
Autodesk.Revit.DB Namespace